Masmiseim36/nxpSDK/boards/evkmimxrt1020/driver_examples/semc/sdram/pin_mux.c
/*
 * The Clear BSD License
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 * that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v4.1
processor: MIMXRT1021xxxxx
package_id: MIMXRT1021DAG5A
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '101', peripheral: LPUART1, signal: RX, pin_signal: GPIO_AD_B0_07, open_drain: Disable}
  - {pin_num: '105', peripheral: LPUART1, signal: TX, pin_signal: GPIO_AD_B0_06, open_drain: Disable}
  - {pin_num: '18', peripheral: SEMC, signal: 'DATA, 00', pin_signal: GPIO_EMC_00, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '17', peripheral: SEMC, signal: 'DATA, 01', pin_signal: GPIO_EMC_01, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '16', peripheral: SEMC, signal: 'DATA, 02', pin_signal: GPIO_EMC_02, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '15', peripheral: SEMC, signal: 'DATA, 03', pin_signal: GPIO_EMC_03, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '14', peripheral: SEMC, signal: 'DATA, 04', pin_signal: GPIO_EMC_04, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '13', peripheral: SEMC, signal: 'DATA, 05', pin_signal: GPIO_EMC_05, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '12', peripheral: SEMC, signal: 'DATA, 06', pin_signal: GPIO_EMC_06, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '10', peripheral: SEMC, signal: 'DATA, 07', pin_signal: GPIO_EMC_07, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '9', peripheral: SEMC, signal: 'DM, 0', pin_signal: GPIO_EMC_08, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '8', peripheral: SEMC, signal: semc_we, pin_signal: GPIO_EMC_09, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '7', peripheral: SEMC, signal: semc_cas, pin_signal: GPIO_EMC_10, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '4', peripheral: SEMC, signal: semc_ras, pin_signal: GPIO_EMC_11, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '3', peripheral: SEMC, signal: 'CS, 0', pin_signal: GPIO_EMC_12, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '2', peripheral: SEMC, signal: 'BA, 0', pin_signal: GPIO_EMC_13, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '1', peripheral: SEMC, signal: 'BA, 1', pin_signal: GPIO_EMC_14, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '143', peripheral: SEMC, signal: 'ADDR, 10', pin_signal: GPIO_EMC_15, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '142', peripheral: SEMC, signal: 'ADDR, 00', pin_signal: GPIO_EMC_16, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_select: Keeper,
    pull_keeper_enable: Disable}
  - {pin_num: '141', peripheral: SEMC, signal: 'ADDR, 01', pin_signal: GPIO_EMC_17, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_select: Keeper,
    pull_keeper_enable: Disable}
  - {pin_num: '140', peripheral: SEMC, signal: 'ADDR, 02', pin_signal: GPIO_EMC_18, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '139', peripheral: SEMC, signal: 'ADDR, 03', pin_signal: GPIO_EMC_19, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '138', peripheral: SEMC, signal: 'ADDR, 04', pin_signal: GPIO_EMC_20, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '137', peripheral: SEMC, signal: 'ADDR, 05', pin_signal: GPIO_EMC_21, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '136', peripheral: SEMC, signal: 'ADDR, 06', pin_signal: GPIO_EMC_22, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '133', peripheral: SEMC, signal: 'ADDR, 07', pin_signal: GPIO_EMC_23, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '132', peripheral: SEMC, signal: 'ADDR, 08', pin_signal: GPIO_EMC_24, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '131', peripheral: SEMC, signal: 'ADDR, 09', pin_signal: GPIO_EMC_25, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '130', peripheral: SEMC, signal: 'ADDR, 11', pin_signal: GPIO_EMC_26, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '129', peripheral: SEMC, signal: 'ADDR, 12', pin_signal: GPIO_EMC_27, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '128', peripheral: SEMC, signal: semc_dqs, pin_signal: GPIO_EMC_28, slew_rate: Fast, software_input_on: Enable, open_drain: Disable, speed: MHZ_200,
    drive_strength: R0_4, pull_keeper_select: Keeper, pull_keeper_enable: Disable}
  - {pin_num: '127', peripheral: SEMC, signal: semc_cke, pin_signal: GPIO_EMC_29, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_select: Keeper,
    pull_keeper_enable: Disable}
  - {pin_num: '126', peripheral: SEMC, signal: semc_clk, pin_signal: GPIO_EMC_30, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '125', peripheral: SEMC, signal: 'DM, 1', pin_signal: GPIO_EMC_31, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '124', peripheral: SEMC, signal: 'DATA, 08', pin_signal: GPIO_EMC_32, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '123', peripheral: SEMC, signal: 'DATA, 09', pin_signal: GPIO_EMC_33, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '122', peripheral: SEMC, signal: 'DATA, 10', pin_signal: GPIO_EMC_34, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '121', peripheral: SEMC, signal: 'DATA, 11', pin_signal: GPIO_EMC_35, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '120', peripheral: SEMC, signal: 'DATA, 12', pin_signal: GPIO_EMC_36, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '119', peripheral: SEMC, signal: 'DATA, 13', pin_signal: GPIO_EMC_37, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '118', peripheral: SEMC, signal: 'DATA, 14', pin_signal: GPIO_EMC_38, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '117', peripheral: SEMC, signal: 'DATA, 15', pin_signal: GPIO_EMC_39, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '116', peripheral: SEMC, signal: 'CSX, 0', pin_signal: GPIO_EMC_40, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
  - {pin_num: '115', peripheral: SEMC, signal: semc_rdy, pin_signal: GPIO_EMC_41, slew_rate: Fast, open_drain: Disable, speed: MHZ_200, drive_strength: R0_4, pull_keeper_enable: Disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

